//Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N. 
int a=11;
if(a%2==0)
{
    while(0<a)
    {
        Console.WriteLine(a);
        a=a-2; 
    }
}else

a=a-1;
{
while(0<a)
{
    Console.WriteLine(a);
    a=a-2;
}
}