//Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).  
int a=6;
 a=a%2;
if(a==0)
{
Console.Write(true);
}else{
    Console.Write(false);
}