//Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
 int a=3;
 int b=6;
 int c=5;
int max=a;
if(b>max) max=b;
if(c>max) max=c;

Console.WriteLine(max);